package ru.liga.dcs.lesson03;

/**
 * Класс представляет собой реализацию кэша, который удаляет наименее недавно использованные элементы,
 * когда достигнута его максимальная ёмкость.
 * The Least Recently Used (LRU)
 */
public class LruCache05 {

    /**
     * Конструктор для создания кэша с определённой ёмкостью.
     *
     * @param capacity Максимальная ёмкость кэша.
     */

    public LruCache05(int capacity) {
    }

    /**
     * Получает значение по ключу из кэша.
     *
     * @param key Ключ, по которому нужно получить значение.
     * @return Значение, соответствующее ключу, или {@code null}, если ключ не найден.
     */
    public Object get(String key) {
        return null;
    }

    /**
     * Добавляет пару ключ-значение в кэш. Если кэш достигает своей максимальной ёмкости,
     * наименее недавно использованный элемент удаляется.
     *
     * @param key   Ключ для добавляемого значения.
     * @param value Значение, которое нужно добавить.
     */
    public void put(String key, Object value) {

    }
}
